# C2 HW -- Stock market -- Financial analysis

In [13]:
"""
Dataset:
https://www.kaggle.com/camnugent/sandp500
"""

'\nDataset:\nhttps://www.kaggle.com/camnugent/sandp500\n'

In [14]:
"""
Dataset details:
Dataset has S&P 500 ticker prices for 5 years. 
date,open,high,low,close,volume,ticker
619041 lines in all_stocks_5yr.csv
bgn_date: 2013-02-08
end_date: 2018-02-07
"""

import pandas as pd
df = pd.read_csv('all_stocks_5yr.csv')
df.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [15]:
df.describe()

,open,high,low,close,volume
count,619029.000000,619032.000000,619032.000000,619040.000000,6.190400e+05
mean,83.023334,83.778311,82.256096,83.043763,4.321823e+06
std,97.378769,98.207519,96.507421,97.389748,8.693610e+06
min,1.620000,1.690000,1.500000,1.590000,0.000000e+00
25%,40.220000,40.620000,39.830000,40.245000,1.070320e+06
50%,62.590000,63.150000,62.020000,62.620000,2.082094e+06
75%,94.370000,95.180000,93.540000,94.410000,4.284509e+06
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08

In [16]:
df.tail()

              date   open   high    low  close   volume Name
619035  2018-02-01  76.84  78.27  76.69  77.82  2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83  2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27  4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86  4534912  ZTS

In [17]:
df.dtypes

date       object
open      float64
high      float64
low       float64
close     float64
volume      int64
Name       object
dtype: object

In [18]:
# convert date objects to date
df['date'] = df['date'].astype('datetime64[ns]')
df.dtypes

date      datetime64[ns]
open             float64
high             float64
low              float64
close            float64
volume             int64
Name              object
dtype: object

In [19]:
df.head()

        date   open   high    low  close    volume Name
0 2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1 2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2 2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3 2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4 2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [20]:
# errors - find blanks df[~df['date'].isin([pd.Timestamp('2016'),pd.Timestamp('2017')])
import numpy as np
np.where(pd.isnull(df))

(array([ 82949,  82949,  82949, 165734, 165857, 165857, 165857, 205076,
        239832, 239832, 239832, 434379, 434502, 434502, 434502, 478594,
        478594, 478594, 558213, 558213, 558213, 581906, 581906, 581906,
        598236, 598236, 598236], dtype=int64),
 array([1, 2, 3, 1, 1, 2, 3, 1, 1, 2, 3, 1, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1,
        2, 3, 1, 2, 3], dtype=int64))

In [21]:
# drop rows with missing values
df.dropna(inplace=True)
df.describe()

,open,high,low,close,volume
count,619029.000000,619029.000000,619029.000000,619029.000000,6.190290e+05
mean,83.023334,83.778419,82.256200,83.043305,4.321892e+06
std,97.378769,98.207735,96.507634,97.388913,8.693671e+06
min,1.620000,1.690000,1.500000,1.590000,1.010000e+02
25%,40.220000,40.620000,39.830000,40.240800,1.070351e+06
50%,62.590000,63.150000,62.020000,62.620000,2.082165e+06
75%,94.370000,95.180000,93.540000,94.410000,4.284550e+06
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08

In [22]:
#drop everything but years for 2016 and 2017
#df[~df['date'].isin([pd.Timestamp('2016'),pd.Timestamp('2017')])
# example game_df = game_df[(game_df['Date'].dt.month != 2) & (game_df['Date'].dt.month != 3) & (game_df['Date'].dt.month != 4)\
#                     & (game_df['Date'].dt.month != 5)]
#df2 = df[df['date'].dt.year == 2016] or df[df['date'].dt.year == 2017]
df2 = df[df['date'].dt.year == 2016]
df2016 = df2['Name']
df3 = df[df['date'].dt.year == 2017]
df2017 = df3['Name']
df2017.head()

982    AAL
983    AAL
984    AAL
985    AAL
986    AAL
Name: Name, dtype: object

In [23]:
# find unique values
df2016.drop_duplicates(keep='first',inplace=True)
df2017.drop_duplicates(keep='first',inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\base.py:1241: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return self._update_inplace(result)

In [24]:
df2017.describe()
df2017.dtypes

dtype('O')

## Homework: Companies which get added/dropped to S&P 500 index create profit making opportunities.

## HW1) Going from 2016 to 2017, a) print the number of tickers dropped and b) print list of tickers which were dropped

In [25]:
# Your code here ...
# count of df2016 and df2017
df2016.describe()

count     499
unique    499
top       OMC
freq        1
Name: Name, dtype: object

In [26]:
df2017.describe()

count     505
unique    505
top       OMC
freq        1
Name: Name, dtype: object

In [80]:
print('No tickers dropped from 2016 to 2017. It increased by:',(505-499))

No tickers dropped from 2016 to 2017. It increased by: 6

In [44]:
#add both and drop duplicates with False flag
dfTickersDropped = pd.concat([df2016, df2017])

In [45]:
dfTickersDropped.head()

730      AAL
1989    AAPL
3248     AAP
4507    ABBV
5766     ABC
Name: Name, dtype: object

In [46]:
dfTickersDropped.describe()

count     1004
unique     505
top        OMC
freq         2
Name: Name, dtype: object

In [47]:
dfTickersDropped.drop_duplicates(False, inplace=True)
dfTickersDropped
#low index range means that they were in the df2016 and not in df2017
#high index range means that they were in the df2017 adn not in df2016

58977     APTV
82942      BHF
83085     BHGE
184005    DWDP
184114     DXC
275204     HLT
Name: Name, dtype: object

In [81]:
df2017.loc[184005] # validate which df tickers are in by index

'DWDP'

# Hw2) Going from 2016 to 2017, a) print the number of tickers added and 2) print list of tickers which were added

In [78]:
# Your code here ...
print('The following 5 tickers were in 2017, but not in 2016')
print('APTV, BHF, BHGE, DWDP, DXC and HLT')

The following 5 tickers were in 2017, but not in 2016
APTV, BHF, BHGE, DWDP, DXC and HLT